Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.Attributes Property
 Gets or sets the reference model object attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReferenceModel.ReferenceModelAttributes Attributes { get; set; }
Public Property Attributes As ReferenceModel.ReferenceModelAttributes
	Get
	Set
Property Value
Type: ReferenceModel.ReferenceModelAttributes
See Also
Reference
ReferenceModel Class
Tekla.Structures.Drawing Namespace